app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "123"], ["password", "123"], ["LIMIT", 1]]
---
	def new_login
		@username = params[:username]
		@password = params[:password]

		@u = User.where(username: @username).where(password: @password).first